[
  {
    "imageUrl": "https://www.icicidirect.com/images/Blog-202306051107590806957.jpg",
    "title": "Healthy volume prints in May 2023; 2-W space outshines!",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/healthy-volume-prints-in-may-2023",
    "description": "Overall wholesale volume prints for May 2023 came in steady with a sequential recovery witnessed almost across all segments.",
    "postDate": "07-Jun-2023 09:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Blog-202306051107590806957.jpg",
    "title": "Earnings outperform in Q4F23; Nifty target retained at 21,500",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/earnings-outperform-in-q4f23-nifty-target-retained-at-21-500",
    "description": "Quarterly earnings in Q4FY23 were positive and 6% ahead of estimates. Incorporating revised PAT numbers for index constituents post Q4FY23, our forward estimates undergo a minor ~1% downgrade. Over FY23-25E, Nifty earnings are seen growing at a CAGR of 16.5%. Rolling over our valuations, we continue to value the Nifty at 21,500 i.e. 20x PE on FY25E EPS of Rs 1080/share. Corresponding target for the Sensex is at 71,600. These are our rolling 12 months’ index target.",
    "postDate": "06-Jun-2023 16:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Syngene-International-Ltd-202304281434418846409.png",
    "title": "Syngene reports well-rounded growth, upbeat guidance - Q4 Review",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/syngene-reports-well-rounded-growth-upbeat-guidance-q4-review",
    "description": "Syngene reported a strong set of numbers driven by incremental orders from existing clients, new contract executions, reflecting revival signs of the CRAMs ecosystem.",
    "postDate": "28-Apr-2023 14:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/JIO-202304241047226114009.png",
    "title": "Reliance Jio - Spells out strong growth outlook!",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/reliance-jio-spells-out-strong-growth-outlook",
    "description": "Reliance Jio reported a muted topline performance in Q4FY23 while margins were better on lower network capex. The key highlight, however, was the strong growth outlook spelt out by the management in the communication business (wireless, broadband and enterprise).",
    "postDate": "24-Apr-2023 11:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Tata Motors-202304201225332756411.png",
    "title": "JLR to accelerate EV push, commits 15 billion pound investment over next five years!",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/jlr-to-accelerate-ev-push-commits-15-billion-pound-investment-over-next-five-years",
    "description": "In a regulatory exchange filing, Tata Motors said its foreign subsidiary, JLR, is planning to invest £15 billion (~Rs 1.52 lakh crore) over the next five years",
    "postDate": "20-Apr-2023 12:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Blog-202304101657077571550.jpg",
    "title": "Domestic auto sales post decadal high volume growth in FY23!",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/domestic-auto-sales-post-decadal-high-volume-growth-in-fy23",
    "description": "Siam reported annual wholesale dispatches for the industry for FY23 wherein total domestic wholesales are seen touching 2.1 crore, up 20.4% YoY. Healthy double digit growth was witnessed across segments with exports coming a tad muted partially tracking global uncertainties and were down 15.2% YoY at 47.6 lakh (primary led by 2-W & 3-W space).",
    "postDate": "17-Apr-2023 15:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Blog-202304101657077571550.jpg",
    "title": "With merger consummated, Jio Cinema, Viacom18 seeking to create OTT behemoth!",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/with-merger-consummated-jio-cinema-viacom18-seeking-to-create-ott-behemoth",
    "description": "Viacom18 has announced that following the sanction by NCLT Mumbai, the scheme of merger of Reliance Storage (RIL subsidiary which houses Jio Cinema) with itself has become effective and Viacom18 has allotted shares to Bodhi Tree Systems [a platform of James Murdoch's Lupa Systems and Uday Shankar with Qatar Investment Authority (QIA) as investor], and RIL group entities as consideration for the scheme of merger.",
    "postDate": "14-Apr-2023 16:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Blog-202304101657077571550.jpg",
    "title": "Healthy performance form specialty chemicals, CRAMs expected to sustain - Chemicals Preview",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/healthy-performance-form-specialty-chemicals-crams-expected-to-sustain-chemicals-preview",
    "description": "The I-direct chemical universe is likely to witness a mixed quarter with agrochem, pharma and some specific specialty players to maintain their growth tempo while packaging, pigments, dyes and polymer players to remain muted. We expect growth of ~11.5% YoY on the revenue front in Q4FY23E.",
    "postDate": "14-Apr-2023 13:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Blog-202304101657077571550.jpg",
    "title": "EBITDA/tonne of steel companies likely to move north in Q4FY23 - Metal Preview",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/ebitda-tonne-of-steel-companies-likely-to-move-north-in-q4fy23-metal-preview",
    "description": "After witnessing a QoQ increase in EBITDA/tonne in Q3FY23, EBITDA/tonne steel companies is likely to further expand in Q4FY23E.",
    "postDate": "14-Apr-2023 12:00"
  },
  {
    "imageUrl": "https://www.icicidirect.com/images/Blog-202304101657077571550.jpg",
    "title": "India narrative upbeat, US can spin positive surprise - Pharmaceuticals Preview",
    "link": "https://www.icicidirect.com/research/equity/one-minutes-read/india-narrative-upbeat-us-can-spin-positive-surprise-pharmaceuticals-preview",
    "description": "The I-direct pharma universe (13 coverage companies) is likely to witness a decent quarter with ~11% growth YoY. This could be on the back of strong YoY growth in domestic formulations as well as better traction in the US portfolio.",
    "postDate": "14-Apr-2023 11:00"
  }
]